## Staging: ecs
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

**⚠️ &nbsp; Warning:** resources will be destroyed by this change!
```terraform
Plan: 2 to add, 0 to change, 2 to destroy
```

<details>
<summary>Show summary</summary>

|  CHANGE  |                      NAME                      |
|----------|------------------------------------------------|
| recreate | `module.saas_procurement.aws_ecs_service.this` |
| add      | `aws_security_group_rule.ecs_egress_database`  |
| delete   | `aws_ecs_cluster.saas_procurement`             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.saas_procurement will be destroyed
  # (because aws_ecs_cluster.saas_procurement is not in configuration)
  - resource "aws_ecs_cluster" "saas_procurement" {
      - arn                = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster" -> null
      - capacity_providers = [
          - "FARGATE",
        ] -> null
      - id                 = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster" -> null
      - name               = "saas-procurement-cluster" -> null
      - tags               = {
          - "CostCentre" = "saas-procurement"
          - "Terraform"  = "true"
        } -> null
      - tags_all           = {
          - "CostCentre" = "saas-procurement"
          - "Terraform"  = "true"
        } -> null

      - default_capacity_provider_strategy {
          - base              = 1 -> null
          - capacity_provider = "FARGATE" -> null
          - weight            = 1 -> null
        }

      - setting {
          - name  = "containerInsights" -> null
          - value = "enabled" -> null
        }
    }

  # aws_security_group_rule.ecs_egress_database will be created
  + resource "aws_security_group_rule" "ecs_egress_database" {
      + description              = "Allow ECS to talk to the RDS cluster"
      + from_port                = 5432
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = "sg-0d1ca7e7e561a219f"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-051638cd60aef88c3"
      + to_port                  = 5432
      + type                     = "egress"
    }

  # module.saas_procurement.aws_ecs_service.this must be replaced
-/+ resource "aws_ecs_service" "this" {
      ~ cluster                            = "arn:aws:ecs:ca-central-1:394954348146:cluster/saas-procurement-cluster" -> "saas-procurement-cluster" # forces replacement
      ~ iam_role                           = "/aws-service-role/ecs.amazonaws.com/AWSServiceRoleForECS" -> (known after apply)
      ~ id                                 = "arn:aws:ecs:ca-central-1:394954348146:service/saas-procurement-cluster/saas-procurement-app-service" -> (known after apply)
        name                               = "saas-procurement-app-service"
        tags                               = {
            "CostCentre" = "saas-procurement"
            "Terraform"  = "true"
        }
      ~ triggers                           = {} -> (known after apply)
        # (13 unchanged attributes hidden)

      - deployment_circuit_breaker {
          - enable   = false -> null
          - rollback = false -> null
        }

        # (3 unchanged blocks hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_cloudwatch_log_group.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_iam_policy.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_iam_role.sentinel_forwarder_lambda"]
WARN - plan.json - main - Missing Common Tags: ["module.saas_procurement.module.sentinel_forwarder[0].aws_lambda_function.sentinel_forwarder"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
